case/cavityFSI/fluid/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          4;
        startFace       1984;
    }
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          56;
        startFace       1988;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          2048;
        startFace       2044;
    }
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          32;
        startFace       4092;
    }
    movingWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          32;
        startFace       4124;
    }
    outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4;
        startFace       4156;
    }
)

// ************************************************************************* //
